Tekla.Structures.Catalogs.UserPropertyOption
The UserPropertyOption class contains the properties of a user property value option.

Tekla.Structures.Catalogs.UserPropertyOption.IntValue
The integer value.

Tekla.Structures.Catalogs.UserPropertyOption.DoubleValue
The double value.

Tekla.Structures.Catalogs.UserPropertyOption.StringValue
The string value.

Tekla.Structures.Catalogs.UserPropertyOption.OptionLabel
The option name.

Tekla.Structures.Catalogs.UserPropertyOption.OptionLabelTranslated
The translated option name.